gitpan/zxid/c/saml2-aux.c
}

/* FUNC(zx_DEEP_CLONE_ds_Signature) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zx_ds_Signature_s* zx_DEEP_CLONE_ds_Signature(struct zx_ctx* c, struct zx_ds_Signature_s* x, int dup_strs)
{
  x = (struct zx_ds_Signature_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zx_ds_Signature_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */

  x->Id = zx_clone_attr(c, x->Id);

  {
      struct zx_ds_SignedInfo_s* e;
      struct zx_ds_SignedInfo_s* en;
      struct zx_ds_SignedInfo_s* enn;
      for (enn = 0, e = x->SignedInfo; e; e = (struct zx_ds_SignedInfo_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_ds_SignedInfo(c, e, dup_strs);
	  if (!enn)
	      x->SignedInfo = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_ds_SignatureValue_s* e;
      struct zx_ds_SignatureValue_s* en;
      struct zx_ds_SignatureValue_s* enn;
      for (enn = 0, e = x->SignatureValue; e; e = (struct zx_ds_SignatureValue_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_ds_SignatureValue(c, e, dup_strs);
	  if (!enn)
	      x->SignatureValue = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_ds_KeyInfo_s* e;
      struct zx_ds_KeyInfo_s* en;
      struct zx_ds_KeyInfo_s* enn;
      for (enn = 0, e = x->KeyInfo; e; e = (struct zx_ds_KeyInfo_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_ds_KeyInfo(c, e, dup_strs);
	  if (!enn)
	      x->KeyInfo = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_ds_Object_s* e;
      struct zx_ds_Object_s* en;
      struct zx_ds_Object_s* enn;
      for (enn = 0, e = x->Object; e; e = (struct zx_ds_Object_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_ds_Object(c, e, dup_strs);
	  if (!enn)
	      x->Object = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zx_FREE_ds_Signature) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zx_FREE_ds_Signature(struct zx_ctx* c, struct zx_ds_Signature_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */

  zx_free_attr(c, x->Id, free_strs);

  {
      struct zx_ds_SignedInfo_s* e;
      struct zx_ds_SignedInfo_s* en;
      for (e = x->SignedInfo; e; e = en) {
	  en = (struct zx_ds_SignedInfo_s*)e->gg.g.n;
	  zx_FREE_ds_SignedInfo(c, e, free_strs);
      }
  }
  {
      struct zx_ds_SignatureValue_s* e;
      struct zx_ds_SignatureValue_s* en;
      for (e = x->SignatureValue; e; e = en) {
	  en = (struct zx_ds_SignatureValue_s*)e->gg.g.n;
	  zx_FREE_ds_SignatureValue(c, e, free_strs);
      }
  }
  {
      struct zx_ds_KeyInfo_s* e;
      struct zx_ds_KeyInfo_s* en;
      for (e = x->KeyInfo; e; e = en) {
	  en = (struct zx_ds_KeyInfo_s*)e->gg.g.n;
	  zx_FREE_ds_KeyInfo(c, e, free_strs);
      }
  }
  {
      struct zx_ds_Object_s* e;
      struct zx_ds_Object_s* en;
      for (e = x->Object; e; e = en) {
	  en = (struct zx_ds_Object_s*)e->gg.g.n;
	  zx_FREE_ds_Object(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zx_NEW_ds_Signature) */

/* Trivial allocator/constructor for the datatype. */

struct zx_ds_Signature_s* zx_NEW_ds_Signature(struct zx_ctx* c)
{
  struct zx_ds_Signature_s* x = ZX_ZALLOC(c, struct zx_ds_Signature_s);
  x->gg.g.tok = zx_ds_Signature_ELEM;
  return x;
}

/* FUNC(zx_WALK_SO_ds_Signature) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zx_WALK_SO_ds_Signature(struct zx_ctx* c, struct zx_ds_Signature_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zx_ds_SignedInfo_s* e;
      for (e = x->SignedInfo; e; e = (struct zx_ds_SignedInfo_s*)e->gg.g.n) {
	  ret = zx_WALK_SO_ds_SignedInfo(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zx_ds_SignatureValue_s* e;
      for (e = x->SignatureValue; e; e = (struct zx_ds_SignatureValue_s*)e->gg.g.n) {
	  ret = zx_WALK_SO_ds_SignatureValue(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zx_ds_KeyInfo_s* e;
      for (e = x->KeyInfo; e; e = (struct zx_ds_KeyInfo_s*)e->gg.g.n) {
	  ret = zx_WALK_SO_ds_KeyInfo(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  {
      struct zx_ds_Object_s* e;
      for (e = x->Object; e; e = (struct zx_ds_Object_s*)e->gg.g.n) {
	  ret = zx_WALK_SO_ds_Object(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zx_WALK_WO_ds_Signature) */

int zx_WALK_WO_ds_Signature(struct zx_ctx* c, struct zx_ds_Signature_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_SignatureMethod
#define EL_STRUCT zx_ds_SignatureMethod_s
#define EL_NS     ds
#define EL_TAG    SignatureMethod

/* FUNC(zx_DUP_STRS_ds_SignatureMethod) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zx_DUP_STRS_ds_SignatureMethod(struct zx_ctx* c, struct zx_ds_SignatureMethod_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */

  zx_dup_attr(c, x->Algorithm);

  zx_dup_strs_simple_elems(c, x->HMACOutputLength);

