gitpan/zxid/c/saml2-aux.c
/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zx_WALK_SO_ds_Transforms(struct zx_ctx* c, struct zx_ds_Transforms_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zx_ds_Transform_s* e;
      for (e = x->Transform; e; e = (struct zx_ds_Transform_s*)e->gg.g.n) {
	  ret = zx_WALK_SO_ds_Transform(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zx_WALK_WO_ds_Transforms) */

int zx_WALK_WO_ds_Transforms(struct zx_ctx* c, struct zx_ds_Transforms_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

#define EL_NAME   ds_X509Data
#define EL_STRUCT zx_ds_X509Data_s
#define EL_NS     ds
#define EL_TAG    X509Data

/* FUNC(zx_DUP_STRS_ds_X509Data) */

/* Depth first traversal of data structure to copy its simple strings
 * to memory allocated from the memory allocator. The decoder will
 * use the underlying wireprotocol PDU buffer for strings, i.e.
 * strings are not copied - they point to the real data. If the
 * datastructure needs to outlast the protocol data or needs a different
 * memory allocation strategy, you need to call this function.  */

void zx_DUP_STRS_ds_X509Data(struct zx_ctx* c, struct zx_ds_X509Data_s* x)
{
  zx_dup_strs_common(c, &x->gg);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zx_ds_X509IssuerSerial_s* e;
      for (e = x->X509IssuerSerial; e; e = (struct zx_ds_X509IssuerSerial_s*)e->gg.g.n)
	  zx_DUP_STRS_ds_X509IssuerSerial(c, e);
  }
  zx_dup_strs_simple_elems(c, x->X509SKI);
  zx_dup_strs_simple_elems(c, x->X509SubjectName);
  zx_dup_strs_simple_elems(c, x->X509Certificate);
  zx_dup_strs_simple_elems(c, x->X509CRL);

}

/* FUNC(zx_DEEP_CLONE_ds_X509Data) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zx_ds_X509Data_s* zx_DEEP_CLONE_ds_X509Data(struct zx_ctx* c, struct zx_ds_X509Data_s* x, int dup_strs)
{
  x = (struct zx_ds_X509Data_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zx_ds_X509Data_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zx_ds_X509IssuerSerial_s* e;
      struct zx_ds_X509IssuerSerial_s* en;
      struct zx_ds_X509IssuerSerial_s* enn;
      for (enn = 0, e = x->X509IssuerSerial; e; e = (struct zx_ds_X509IssuerSerial_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_ds_X509IssuerSerial(c, e, dup_strs);
	  if (!enn)
	      x->X509IssuerSerial = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  x->X509SKI = zx_deep_clone_simple_elems(c,x->X509SKI, dup_strs);
  x->X509SubjectName = zx_deep_clone_simple_elems(c,x->X509SubjectName, dup_strs);
  x->X509Certificate = zx_deep_clone_simple_elems(c,x->X509Certificate, dup_strs);
  x->X509CRL = zx_deep_clone_simple_elems(c,x->X509CRL, dup_strs);

  return x;
}

/* FUNC(zx_FREE_ds_X509Data) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zx_FREE_ds_X509Data(struct zx_ctx* c, struct zx_ds_X509Data_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zx_ds_X509IssuerSerial_s* e;
      struct zx_ds_X509IssuerSerial_s* en;
      for (e = x->X509IssuerSerial; e; e = en) {
	  en = (struct zx_ds_X509IssuerSerial_s*)e->gg.g.n;
	  zx_FREE_ds_X509IssuerSerial(c, e, free_strs);
      }
  }
  zx_free_simple_elems(c, x->X509SKI, free_strs);
  zx_free_simple_elems(c, x->X509SubjectName, free_strs);
  zx_free_simple_elems(c, x->X509Certificate, free_strs);
  zx_free_simple_elems(c, x->X509CRL, free_strs);


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zx_NEW_ds_X509Data) */

/* Trivial allocator/constructor for the datatype. */

struct zx_ds_X509Data_s* zx_NEW_ds_X509Data(struct zx_ctx* c)
{
  struct zx_ds_X509Data_s* x = ZX_ZALLOC(c, struct zx_ds_X509Data_s);
  x->gg.g.tok = zx_ds_X509Data_ELEM;
  return x;
}

/* FUNC(zx_WALK_SO_ds_X509Data) */

/* Depth first traversal of the tree in either schema order or the wire order. */
 
int zx_WALK_SO_ds_X509Data(struct zx_ctx* c, struct zx_ds_X509Data_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  int ret = callback(&x->gg.g, ctx);
  if (ret)
    return ret;
  
  /* *** deal with xmlns specifications in exc c14n way */


  
  ret = zx_walk_so_unknown_attributes(c, &x->gg, ctx, callback); 
  if (ret)
    return ret;

  {
      struct zx_ds_X509IssuerSerial_s* e;
      for (e = x->X509IssuerSerial; e; e = (struct zx_ds_X509IssuerSerial_s*)e->gg.g.n) {
	  ret = zx_WALK_SO_ds_X509IssuerSerial(c, e, ctx, callback);
	  if (ret)
	      return ret;
      }
  }
  ret = zx_walk_so_simple_elems(c, x->X509SKI, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->X509SubjectName, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->X509Certificate, ctx, callback);
  if (ret)
    return ret;
  ret = zx_walk_so_simple_elems(c, x->X509CRL, ctx, callback);
  if (ret)
    return ret;

  
  return zx_walk_so_unknown_elems_and_content(c, &x->gg, ctx, callback);
}

/* FUNC(zx_WALK_WO_ds_X509Data) */

int zx_WALK_WO_ds_X509Data(struct zx_ctx* c, struct zx_ds_X509Data_s* x, void* ctx, int (*callback)(struct zx_node_s* node, void* ctx))
{
  ERR("*** walk_wo not implemented %d", 0);
  return 0;
}




#ifdef EL_NAME
#undef EL_NAME
#endif
#ifdef EL_STRUCT
#undef EL_STRUCT
#endif
#ifdef EL_NS
#undef EL_NS
#endif
#ifdef EL_TAG
#undef EL_TAG
#endif

