gitpan/zxid/c/saml2-aux.c
}

/* FUNC(zx_DEEP_CLONE_se_Body) */

/* Depth first traversal of data structure to clone it and its sublements.
 * The simple strings are handled as a special case according to dup_strs flag. */

struct zx_se_Body_s* zx_DEEP_CLONE_se_Body(struct zx_ctx* c, struct zx_se_Body_s* x, int dup_strs)
{
  x = (struct zx_se_Body_s*)zx_clone_elem_common(c, &x->gg, sizeof(struct zx_se_Body_s), dup_strs);
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zx_sp_ArtifactResolve_s* e;
      struct zx_sp_ArtifactResolve_s* en;
      struct zx_sp_ArtifactResolve_s* enn;
      for (enn = 0, e = x->ArtifactResolve; e; e = (struct zx_sp_ArtifactResolve_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_ArtifactResolve(c, e, dup_strs);
	  if (!enn)
	      x->ArtifactResolve = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_ArtifactResponse_s* e;
      struct zx_sp_ArtifactResponse_s* en;
      struct zx_sp_ArtifactResponse_s* enn;
      for (enn = 0, e = x->ArtifactResponse; e; e = (struct zx_sp_ArtifactResponse_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_ArtifactResponse(c, e, dup_strs);
	  if (!enn)
	      x->ArtifactResponse = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_ManageNameIDRequest_s* e;
      struct zx_sp_ManageNameIDRequest_s* en;
      struct zx_sp_ManageNameIDRequest_s* enn;
      for (enn = 0, e = x->ManageNameIDRequest; e; e = (struct zx_sp_ManageNameIDRequest_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_ManageNameIDRequest(c, e, dup_strs);
	  if (!enn)
	      x->ManageNameIDRequest = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_ManageNameIDResponse_s* e;
      struct zx_sp_ManageNameIDResponse_s* en;
      struct zx_sp_ManageNameIDResponse_s* enn;
      for (enn = 0, e = x->ManageNameIDResponse; e; e = (struct zx_sp_ManageNameIDResponse_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_ManageNameIDResponse(c, e, dup_strs);
	  if (!enn)
	      x->ManageNameIDResponse = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_LogoutRequest_s* e;
      struct zx_sp_LogoutRequest_s* en;
      struct zx_sp_LogoutRequest_s* enn;
      for (enn = 0, e = x->LogoutRequest; e; e = (struct zx_sp_LogoutRequest_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_LogoutRequest(c, e, dup_strs);
	  if (!enn)
	      x->LogoutRequest = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_LogoutResponse_s* e;
      struct zx_sp_LogoutResponse_s* en;
      struct zx_sp_LogoutResponse_s* enn;
      for (enn = 0, e = x->LogoutResponse; e; e = (struct zx_sp_LogoutResponse_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_LogoutResponse(c, e, dup_strs);
	  if (!enn)
	      x->LogoutResponse = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_NameIDMappingRequest_s* e;
      struct zx_sp_NameIDMappingRequest_s* en;
      struct zx_sp_NameIDMappingRequest_s* enn;
      for (enn = 0, e = x->NameIDMappingRequest; e; e = (struct zx_sp_NameIDMappingRequest_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_NameIDMappingRequest(c, e, dup_strs);
	  if (!enn)
	      x->NameIDMappingRequest = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_NameIDMappingResponse_s* e;
      struct zx_sp_NameIDMappingResponse_s* en;
      struct zx_sp_NameIDMappingResponse_s* enn;
      for (enn = 0, e = x->NameIDMappingResponse; e; e = (struct zx_sp_NameIDMappingResponse_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_NameIDMappingResponse(c, e, dup_strs);
	  if (!enn)
	      x->NameIDMappingResponse = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_AttributeQuery_s* e;
      struct zx_sp_AttributeQuery_s* en;
      struct zx_sp_AttributeQuery_s* enn;
      for (enn = 0, e = x->AttributeQuery; e; e = (struct zx_sp_AttributeQuery_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_AttributeQuery(c, e, dup_strs);
	  if (!enn)
	      x->AttributeQuery = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_AuthnQuery_s* e;
      struct zx_sp_AuthnQuery_s* en;
      struct zx_sp_AuthnQuery_s* enn;
      for (enn = 0, e = x->AuthnQuery; e; e = (struct zx_sp_AuthnQuery_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_AuthnQuery(c, e, dup_strs);
	  if (!enn)
	      x->AuthnQuery = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_AuthzDecisionQuery_s* e;
      struct zx_sp_AuthzDecisionQuery_s* en;
      struct zx_sp_AuthzDecisionQuery_s* enn;
      for (enn = 0, e = x->AuthzDecisionQuery; e; e = (struct zx_sp_AuthzDecisionQuery_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_AuthzDecisionQuery(c, e, dup_strs);
	  if (!enn)
	      x->AuthzDecisionQuery = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_AssertionIDRequest_s* e;
      struct zx_sp_AssertionIDRequest_s* en;
      struct zx_sp_AssertionIDRequest_s* enn;
      for (enn = 0, e = x->AssertionIDRequest; e; e = (struct zx_sp_AssertionIDRequest_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_AssertionIDRequest(c, e, dup_strs);
	  if (!enn)
	      x->AssertionIDRequest = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_sp_Response_s* e;
      struct zx_sp_Response_s* en;
      struct zx_sp_Response_s* enn;
      for (enn = 0, e = x->Response; e; e = (struct zx_sp_Response_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_sp_Response(c, e, dup_strs);
	  if (!enn)
	      x->Response = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }
  {
      struct zx_se_Fault_s* e;
      struct zx_se_Fault_s* en;
      struct zx_se_Fault_s* enn;
      for (enn = 0, e = x->Fault; e; e = (struct zx_se_Fault_s*)e->gg.g.n) {
	  en = zx_DEEP_CLONE_se_Fault(c, e, dup_strs);
	  if (!enn)
	      x->Fault = en;
	  else
	      enn->gg.g.n = &en->gg.g;
	  enn = en;
      }
  }

  return x;
}

/* FUNC(zx_FREE_se_Body) */

/* Depth first traversal of data structure to free it and its subelements. Simple
 * strings are handled as a special case according to the free_strs flag. This
 * is useful if the strings point to underlying data from the wire that was
 * allocated differently. */

void zx_FREE_se_Body(struct zx_ctx* c, struct zx_se_Body_s* x, int free_strs)
{
  /* *** deal with xmlns specifications in exc c14n way */


  {
      struct zx_sp_ArtifactResolve_s* e;
      struct zx_sp_ArtifactResolve_s* en;
      for (e = x->ArtifactResolve; e; e = en) {
	  en = (struct zx_sp_ArtifactResolve_s*)e->gg.g.n;
	  zx_FREE_sp_ArtifactResolve(c, e, free_strs);
      }
  }
  {
      struct zx_sp_ArtifactResponse_s* e;
      struct zx_sp_ArtifactResponse_s* en;
      for (e = x->ArtifactResponse; e; e = en) {
	  en = (struct zx_sp_ArtifactResponse_s*)e->gg.g.n;
	  zx_FREE_sp_ArtifactResponse(c, e, free_strs);
      }
  }
  {
      struct zx_sp_ManageNameIDRequest_s* e;
      struct zx_sp_ManageNameIDRequest_s* en;
      for (e = x->ManageNameIDRequest; e; e = en) {
	  en = (struct zx_sp_ManageNameIDRequest_s*)e->gg.g.n;
	  zx_FREE_sp_ManageNameIDRequest(c, e, free_strs);
      }
  }
  {
      struct zx_sp_ManageNameIDResponse_s* e;
      struct zx_sp_ManageNameIDResponse_s* en;
      for (e = x->ManageNameIDResponse; e; e = en) {
	  en = (struct zx_sp_ManageNameIDResponse_s*)e->gg.g.n;
	  zx_FREE_sp_ManageNameIDResponse(c, e, free_strs);
      }
  }
  {
      struct zx_sp_LogoutRequest_s* e;
      struct zx_sp_LogoutRequest_s* en;
      for (e = x->LogoutRequest; e; e = en) {
	  en = (struct zx_sp_LogoutRequest_s*)e->gg.g.n;
	  zx_FREE_sp_LogoutRequest(c, e, free_strs);
      }
  }
  {
      struct zx_sp_LogoutResponse_s* e;
      struct zx_sp_LogoutResponse_s* en;
      for (e = x->LogoutResponse; e; e = en) {
	  en = (struct zx_sp_LogoutResponse_s*)e->gg.g.n;
	  zx_FREE_sp_LogoutResponse(c, e, free_strs);
      }
  }
  {
      struct zx_sp_NameIDMappingRequest_s* e;
      struct zx_sp_NameIDMappingRequest_s* en;
      for (e = x->NameIDMappingRequest; e; e = en) {
	  en = (struct zx_sp_NameIDMappingRequest_s*)e->gg.g.n;
	  zx_FREE_sp_NameIDMappingRequest(c, e, free_strs);
      }
  }
  {
      struct zx_sp_NameIDMappingResponse_s* e;
      struct zx_sp_NameIDMappingResponse_s* en;
      for (e = x->NameIDMappingResponse; e; e = en) {
	  en = (struct zx_sp_NameIDMappingResponse_s*)e->gg.g.n;
	  zx_FREE_sp_NameIDMappingResponse(c, e, free_strs);
      }
  }
  {
      struct zx_sp_AttributeQuery_s* e;
      struct zx_sp_AttributeQuery_s* en;
      for (e = x->AttributeQuery; e; e = en) {
	  en = (struct zx_sp_AttributeQuery_s*)e->gg.g.n;
	  zx_FREE_sp_AttributeQuery(c, e, free_strs);
      }
  }
  {
      struct zx_sp_AuthnQuery_s* e;
      struct zx_sp_AuthnQuery_s* en;
      for (e = x->AuthnQuery; e; e = en) {
	  en = (struct zx_sp_AuthnQuery_s*)e->gg.g.n;
	  zx_FREE_sp_AuthnQuery(c, e, free_strs);
      }
  }
  {
      struct zx_sp_AuthzDecisionQuery_s* e;
      struct zx_sp_AuthzDecisionQuery_s* en;
      for (e = x->AuthzDecisionQuery; e; e = en) {
	  en = (struct zx_sp_AuthzDecisionQuery_s*)e->gg.g.n;
	  zx_FREE_sp_AuthzDecisionQuery(c, e, free_strs);
      }
  }
  {
      struct zx_sp_AssertionIDRequest_s* e;
      struct zx_sp_AssertionIDRequest_s* en;
      for (e = x->AssertionIDRequest; e; e = en) {
	  en = (struct zx_sp_AssertionIDRequest_s*)e->gg.g.n;
	  zx_FREE_sp_AssertionIDRequest(c, e, free_strs);
      }
  }
  {
      struct zx_sp_Response_s* e;
      struct zx_sp_Response_s* en;
      for (e = x->Response; e; e = en) {
	  en = (struct zx_sp_Response_s*)e->gg.g.n;
	  zx_FREE_sp_Response(c, e, free_strs);
      }
  }
  {
      struct zx_se_Fault_s* e;
      struct zx_se_Fault_s* en;
      for (e = x->Fault; e; e = en) {
	  en = (struct zx_se_Fault_s*)e->gg.g.n;
	  zx_FREE_se_Fault(c, e, free_strs);
      }
  }


  zx_free_elem_common(c, &x->gg, free_strs); 
}

/* FUNC(zx_NEW_se_Body) */

/* Trivial allocator/constructor for the datatype. */

struct zx_se_Body_s* zx_NEW_se_Body(struct zx_ctx* c)
{
  struct zx_se_Body_s* x = ZX_ZALLOC(c, struct zx_se_Body_s);
  x->gg.g.tok = zx_se_Body_ELEM;
  return x;
}

